tangyangguang/Esp32_Faucet/src/main.cpp
#include <Arduino.h>
#include <Esp32Base.h>
#include <network/Esp32BaseWiFi.h>
#include <Wire.h>

#include "app/AppController.h"
#include "app/BeepDriver.h"
#include "app/CalibrationSessionTraceStore.h"
#include "app/ColorDisplayPresenter.h"
#include "app/CalibrationSessionStore.h"
#include "app/ConfigStore.h"
#include "app/DateTimeUtils.h"
#include "app/Esp32BaseConfigBackend.h"
#include "app/Esp32BaseWaterRecordBackend.h"
#include "app/FaucetAppConfig.h"
#include "app/FilterStore.h"
#include "app/MeteringSchemeStore.h"
#include "app/StatisticsStore.h"
#include "app/TimeUtils.h"
#include "app/WaterRecordFileStore.h"
#include "app/WaterRecordStore.h"
#include "app/WaterPulseTraceStore.h"
#include "drivers/BoardPins.h"
#include "drivers/Esp32AnalogAdcReader.h"
#include "drivers/FlowPulseReader.h"
#include "drivers/GpioButtonReader.h"
#include "drivers/PwmBeepHardware.h"
#include "drivers/PwmValveHardware.h"
#include "drivers/RtcClock.h"
#include "drivers/St7789Display.h"
#include "web/FaucetWeb.h"

#include <algorithm>
#include <new>
#include <time.h>

namespace {
constexpr const char* kFirmwareName = "esp32-faucet";
constexpr const char* kFirmwareVersion = "0.1.0-dev";
constexpr const char* kDefaultWebUser = "admin";
constexpr const char* kDefaultWebPassword = "admin";
constexpr std::size_t kRamRecordCapacity = 128;
constexpr std::size_t kWaterRecordCapacity = 15000;
constexpr std::size_t kPulseTraceCapacity = faucet::kRecentPulseTraceCount;
constexpr std::size_t kPulseTraceMaxBuckets =
    static_cast<std::size_t>(faucet::kRecentPulseTraceCount) * faucet::kPulseTraceMaxBucketsPerTrace;
constexpr std::size_t kPulseTraceMaxStartupEdges =
    static_cast<std::size_t>(faucet::kRecentPulseTraceCount) * faucet::kPulseTraceMaxStartupEdgesPerTrace;
constexpr std::uint32_t kRuntimePersistenceRetryIntervalMs = 30000UL;
constexpr std::size_t kMaxFlowPulsesPerTick = 32;
constexpr std::uint32_t kI2cTimeoutMs = 20UL;
constexpr const char* kWaterRecordPath = "/faucet_records_v3.bin";
constexpr const char* kMeteringSchemePath = "/faucet_metering_schemes_v8.bin";
constexpr const char* kCalibrationSessionPath = "/faucet_cal_session_v1.bin";
constexpr const char* kCalibrationSessionTracePath = "/faucet_cal_session_traces_v1.bin";

class PersistentRecordWriter : public faucet::WaterRecordWriter, public faucet::WaterRecordReader {
public:
    PersistentRecordWriter() : fileStore_(nullptr), ramStore_(records_, kRamRecordCapacity) {}

    void setFileStore(faucet::WaterRecordFileStore* store) {
        fileStore_ = store;
    }

    bool append(const faucet::WaterRecord& record) override {
        if (fileStore_ && fileStore_->append(record)) {
            return true;
        }
        return ramStore_.append(record);
    }

    std::size_t rewriteBootRelativeTimes(std::uint32_t bootId, std::uint32_t bootStartRealSec) {
        if (fileStore_ && fileStore_->ready()) {
            return fileStore_->rewriteBootRelativeTimes(bootId, bootStartRealSec);
        }
        return ramStore_.rewriteBootRelativeTimes(bootId, bootStartRealSec);
    }

    std::size_t readPage(std::size_t pageIndex,
                         std::uint16_t pageSize,
                         faucet::WaterRecord* output,
                         std::size_t outputCapacity) const override {
        if (fileStore_ && fileStore_->ready()) {
            return fileStore_->readPage(pageIndex, pageSize, output, outputCapacity);
        }
        return ramStore_.readPage(pageIndex, pageSize, output, outputCapacity);
    }

    std::size_t count() const override {
        return fileStore_ && fileStore_->ready() ? fileStore_->count() : ramStore_.count();
    }

    bool ready() const override {
        return (fileStore_ && fileStore_->ready()) || ramStore_.ready();
    }

    const char* storageName() const override {
        return fileStore_ && fileStore_->ready() ? fileStore_->storageName() : ramStore_.storageName();
    }

    faucet::WaterRecordFileStatus status() const override {
        if (fileStore_) {
            const faucet::WaterRecordFileStatus fileStatus = fileStore_->status();
            if (fileStatus != faucet::WaterRecordFileStatus::Ready) {
                return fileStatus;
            }
        }
        return fileStore_ && fileStore_->ready() ? fileStore_->status() : ramStore_.status();
    }

private:
    faucet::WaterRecordFileStore* fileStore_;
    faucet::WaterRecord records_[kRamRecordCapacity]{};
    faucet::WaterRecordStore ramStore_;
};

faucet::Esp32BaseConfigBackend g_configBackend;
faucet::ConfigStore g_configStore(g_configBackend);
faucet::SystemConfig g_config{};
faucet::StatisticsStore g_statistics;
faucet::FilterStore* g_filters = nullptr;
faucet::Esp32BaseWaterRecordBackend g_waterRecordBackend;
faucet::WaterRecordFileStore g_waterRecordFile(g_waterRecordBackend, kWaterRecordPath, kWaterRecordCapacity);
faucet::MeteringSchemeStore g_meteringSchemes(g_waterRecordBackend, kMeteringSchemePath);
faucet::CalibrationSessionFileStore g_calibrationSession(g_waterRecordBackend, kCalibrationSessionPath);
faucet::CalibrationSessionTraceStore g_calibrationSessionTraces(g_waterRecordBackend, kCalibrationSessionTracePath);
PersistentRecordWriter g_records;
faucet::WaterPulseTrace* g_pulseTraceRecords = nullptr;
faucet::WaterPulseTraceBucketSample* g_pulseTraceBuckets = nullptr;
faucet::WaterPulseTraceSample* g_pulseTraceStartupEdges = nullptr;
faucet::WaterPulseTraceStore* g_pulseTraces = nullptr;
faucet::AppController* g_app = nullptr;
faucet::GpioButtonReader g_buttons(faucet::kPinButtonCancel,
                                   faucet::kPinButtonOk,
                                   faucet::kPinButtonPlus,
                                   faucet::kPinButtonMinus);
faucet::FlowPulseReader g_flowPulses(faucet::kPinFlow);
faucet::Esp32AnalogAdcReader g_waterSensorAdc;
faucet::WaterSensorManager g_waterSensors(g_waterSensorAdc, false);
faucet::PwmValveHardware g_valveHardware(faucet::kPinValve, faucet::kLedcChannelValve);
faucet::BeepDriver g_beep;
faucet::PwmBeepHardware g_beepHardware(faucet::kPinBeep, faucet::kLedcChannelBeep);
faucet::RtcClock g_rtc(faucet::kPinI2cSda, faucet::kPinI2cScl);
faucet::St7789Display g_st7789(faucet::kPinSt7789Backlight);
faucet::ColorDisplayPresenter* g_colorDisplay = nullptr;
faucet::ColorDisplayFrame g_lastColorDisplayFrame{};
bool g_persistenceFailureLogged = false;
bool g_runtimePersistenceRetryActive = false;
bool g_rebuildRecordStoreAfterFormatFs = false;
std::uint32_t g_lastRuntimePersistenceFailureMs = 0;
std::uint32_t g_lastColorDisplayMs = 0;
std::uint32_t g_lastDroppedPulsesLogged = 0;
std::uint32_t g_lastDroppedPulsesLogMs = 0;
bool g_bootRelativeTimesRewritten = false;
std::uint32_t g_lastLoopStartUs = 0;
std::uint32_t g_maxLoopIntervalUs = 0;
std::uint32_t g_maxAppTickUs = 0;
std::uint32_t g_maxBaseHandleUs = 0;
bool g_baseBeginComplete = false;
bool g_littleFsInitComplete = false;
bool g_configInitComplete = false;
bool g_recordStoreInitComplete = false;
bool g_traceStoreInitComplete = false;
bool g_runtimeStateInitComplete = false;
bool g_appControllerInitComplete = false;
bool g_valveClosedApplied = false;
bool g_otaMarkValidAttempted = false;

void configureBase() {
    Esp32Base::setFirmwareInfo(kFirmwareName, kFirmwareVersion, __DATE__ " " __TIME__);

#if ESP32BASE_ENABLE_WEB
    Esp32BaseWeb::setDefaultAuth(kDefaultWebUser, kDefaultWebPassword);
    Esp32BaseWeb::setDeviceName("首页");
    Esp32BaseWeb::setHomePath("/index");
    Esp32BaseWeb::setHomeMode(Esp32BaseWeb::HOME_COMBINED);
    Esp32BaseWeb::setSystemNavMode(Esp32BaseWeb::SYSTEM_NAV_SECTION);
    if (!faucet::registerFaucetAppConfig()) {
        ESP32BASE_LOG_E("app", "app config registration failed");
    }
    if (!faucet::registerFaucetWeb()) {
        ESP32BASE_LOG_E("app", "faucet web route registration failed");
    }
#endif
}

